ch570512/Qlockwork/src/main.cpp
//=============================================================================
// QLOCKWORK
// @created 12.03.2017
// @mc ESP8266
//
// This source file is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published
// by the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// This source file is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with this program.  If not, see <http://www.gnu.org/licenses/>.
//=============================================================================

#if !defined(ESP8266)
#error This code is designed to run on ESP8266-based boards! Please check your Tools->Board setting.
#endif

#define FIRMWARE_VERSION 20260527

#include <Arduino.h>
#include <ArduinoOTA.h>
#include <DHT.h>
#include <DS3232RTC.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <IRremoteESP8266.h>
#include <IRutils.h>
#include <time.h>
#include <WiFiManager.h>
#include "Colors.h"
#include "Configuration.h"
#include "Debug.h"
#include "Events.h"
#include "LedDriver.h"
#include "MeteoWeather.h"
#include "Modes.h"
#include "Renderer.h"
#include "Settings.h"
#include "Syslog.h"
#include "WebServer.h"

void buttonModeInterrupt();
void buttonModePressed();
void buttonOnOffInterrupt();
void buttonOnOffPressed();
void buttonTimeInterrupt();
void buttonTimePressed();
void callRoot();
uint8_t getBrightnessFromLDR();
int getMoonphase(int y, int m, int d);
void getRoomConditions();
time_t getRTCTime();
void handleButtonSettings();
void handleCommitSettings();
void handleControl();
// void handleNotFound();
void handleRoot();
void handleSetEvent();
void handleShowText();
void moveScreenBufferUp(uint16_t screenBufferOld[], uint16_t screenBufferNew[], uint8_t color, uint8_t brightness);
String padStringZeros(String input);
void setLedsOff();
void setLedsOn();
void setMode(Mode newMode);
void setupWebServer();
void writeScreenBuffer(uint16_t screenBuffer[], uint8_t color, uint8_t brightness);
void writeScreenBufferFade(uint16_t screenBufferOld[], uint16_t screenBufferNew[], uint8_t color, uint8_t brightness);

//=============================================================================
// Init
//=============================================================================

// HTTP-Server
#ifdef WEBSERVER
ESP8266WebServer webServer(80);
#endif

// DHT22
#ifdef SENSOR_DHT22
DHT dht(PIN_DHT22, DHT22);
#endif

// IR receiver
#ifdef IR_RECEIVER
IRrecv irrecv(PIN_IR_RECEIVER);
decode_results irDecodeResult;
#endif

// Syslog
#ifdef SYSLOGSERVER_SERVER
WiFiUDP wifiUdp;
Syslog syslog(wifiUdp, SYSLOGSERVER_SERVER, SYSLOGSERVER_PORT, HOSTNAME, "QLOCKWORK", LOG_INFO);
#endif

// RTC
#ifdef RTC_BACKUP
DS3232RTC RTC;
#endif

// LED driver
LedDriver ledDriver;

// Renderer
Renderer renderer;

// Settings
Settings settings;

// Screenbuffer
uint16_t matrix[10] = {};
uint16_t matrixOld[10] = {};
bool screenBufferNeedsUpdate = true;

// Mode
Mode mode = MODE_TIME;
Mode lastMode = mode;
uint32_t modeTimeout = 0;
uint32_t autoModeChangeTimer = AUTO_MODECHANGE_TIME;
bool runTransitionOnce = false;
uint8_t autoMode = 0;

// Time
uint8_t lastDay = 0;
uint8_t lastMinute = 0;
uint8_t lastHour = 0;
uint8_t lastSecond = 0;
uint8_t randomHour = 0;
uint8_t randomMinute = 0;
uint8_t moonphase = 0;
time_t upTime = 0;

// Feed
String feedText = "";
uint8_t feedColor = WHITE;
uint8_t feedPosition = 0;

// MeteoWeather
#ifdef WEATHER
MeteoWeather outdoorWeather;
uint8_t errorCounterOutdoorWeather = 0;
#endif

// DHT22
float roomTemperature = 0;
float roomHumidity = 0;
uint8_t errorCounterDHT = 0;

// Brightness and LDR
uint8_t maxBrightness = 0;
uint8_t brightness = 0;
#ifdef LDR
// uint16_t ldrValue = 0;
// uint16_t lastLdrValue = 0;
// uint16_t minLdrValue = 511;
// uint16_t maxLdrValue = 512;
uint8_t iTargetBrightness = 0;
unsigned long iBrightnessMillis = 0;
#endif

// Alarm
#ifdef BUZZER
bool alarmTimerSet = false;
uint8_t alarmTimer = 0;
uint8_t alarmTimerSecond = 0;
uint8_t alarmOn = false;
#endif

// Events
#ifdef EVENT_TIME
uint32_t showEventTimer = EVENT_TIME;
#endif

// Sunrise and sunset
#if defined(SHOW_MODE_SUNRISE_SUNSET) && defined(WEATHER)
bool sunrise_started = false;
unsigned long sunrise_millis = 0;
bool sunset_started = false;
unsigned long sunset_millis = 0;
time_t sunset_unix = 0;
time_t sunrise_unix = 0;
int save_color_sunrise_sunset = settings.mySettings.color;
#endif

// Misc
IPAddress myIP = {0, 0, 0, 0};
uint32_t lastButtonPress = 0;
bool testFlag = false;
uint8_t testColumn = 0;
#ifdef DEBUG_FPS
int fps = 0;
#endif

//=============================================================================
// Setup()
//=============================================================================

void setup()
{
    // Init serial port
    Serial.begin(115200);
    while (!Serial && millis() < 5000)
        ;
    delay(1000);

    // And the monkey flips the switch. (Akiva Goldsman)
    Serial.println(F("\n\n*** QLOCKWORK ***"));
    Serial.print(F("Firmware: ") + String(FIRMWARE_VERSION));
    Serial.print(F("\nStarting on ") + String(ARDUINO_BOARD));
    Serial.print(F("\nCPU Frequency = "));
    Serial.print(F_CPU / 1000000);
    Serial.println(F(" MHz"));

    // Load settings
    settings.loadFromEEPROM();
    maxBrightness = map(settings.mySettings.brightness, 0, 100, MIN_BRIGHTNESS, MAX_BRIGHTNESS);
    brightness = maxBrightness;

#ifdef POWERON_SELFTEST
    renderer.setAllScreenBuffer(matrix);
    Serial.println(F("Set all LEDs to red."));
    writeScreenBuffer(matrix, RED, brightness);
    delay(2500);
    Serial.println(F("Set all LEDs to green."));
    writeScreenBuffer(matrix, GREEN, brightness);
    delay(2500);
    Serial.println(F("Set all LEDs to blue."));
    writeScreenBuffer(matrix, BLUE, brightness);
    delay(2500);
    Serial.println(F("Set all LEDs to white."));
    writeScreenBuffer(matrix, WHITE, brightness);
    delay(2500);
#endif

#ifdef ESP_LED
    Serial.println(F("Setting up ESP-LED."));
    pinMode(PIN_LED, OUTPUT);
    digitalWrite(PIN_LED, HIGH);
#endif

#ifdef MODE_BUTTON
    Serial.println(F("Setting up Mode-Button."));
    pinMode(PIN_MODE_BUTTON, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PIN_MODE_BUTTON), buttonModeInterrupt, FALLING);
#endif

#ifdef ONOFF_BUTTON
    Serial.println(F("Setting up Back-Button."));
    pinMode(PIN_ONOFF_BUTTON, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PIN_ONOFF_BUTTON), buttonOnOffInterrupt, FALLING);
#endif

#ifdef TIME_BUTTON
    Serial.println(F("Setting up Time-Button."));
    pinMode(PIN_TIME_BUTTON, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PIN_TIME_BUTTON), buttonTimeInterrupt, FALLING);
#endif

#ifdef BUZZER
    Serial.println(F("Setting up Buzzer."));
    pinMode(PIN_BUZZER, OUTPUT);
#endif

#ifdef SENSOR_DHT22
    Serial.println(F("Setting up DHT22."));
    dht.begin();
#endif

#ifdef LDR
    Serial.print(F("Setting up LDR. ABC: "));
    settings.mySettings.useAbc ? Serial.println(F("enabled")) : Serial.println(F("disabled"));
    pinMode(PIN_LDR, INPUT);
#endif

#ifdef IR_RECEIVER
    Serial.println(F("Setting up IR-Receiver."));
    irrecv.enableIRIn();
#endif

    // Start WiFi
    renderer.clearScreenBuffer(matrix);
    renderer.setSmallText("WI", TEXT_POS_TOP, matrix);
    renderer.setSmallText("FI", TEXT_POS_BOTTOM, matrix);
    writeScreenBuffer(matrix, WHITE, brightness);
    WiFiManager wifiManager;
    // wifiManager.resetSettings();
    wifiManager.setConnectTimeout(30);
    wifiManager.setTimeout(120);
    wifiManager.autoConnect(HOSTNAME, WIFI_AP_PASS);
    WiFi.hostname(HOSTNAME);
    WiFi.setAutoConnect(true);
    WiFi.setAutoReconnect(true);
    if (!WiFi.isConnected())
    {
        // WiFi.mode(WIFI_AP);
        Serial.println(F("No WiFi connected."));
        writeScreenBuffer(matrix, RED, brightness);
        delay(1000);
        // myIP = WiFi.softAPIP();
    }
    else
    {
        WiFi.mode(WIFI_STA);
        Serial.println("Hostname: " + String(HOSTNAME));
        Serial.println("RSSI: " + String(WiFi.RSSI()));
        writeScreenBuffer(matrix, GREEN, brightness);
        delay(1000);
        myIP = WiFi.localIP();

        // Get weather from MeteoWeather
#ifdef WEATHER
        DEBUG_SERIAL_PRINTLN(F("Weather Latitude: ") + String(LATITUDE));
        DEBUG_SERIAL_PRINTLN(F("Weather Longitude: ") + String(LONGITUDE));
        DEBUG_SERIAL_PRINTLN(F("Weather Timezone: ") + String(TIMEZONE));
        DEBUG_SERIAL_PRINTLN(F("Getting weather..."));
        !outdoorWeather.getOutdoorConditions(LATITUDE, LONGITUDE, TIMEZONE) ? errorCounterOutdoorWeather++ : errorCounterOutdoorWeather = 0;
        DEBUG_SERIAL_PRINTLN(F("Outdoor temperature: ") + String(outdoorWeather.temperature) + F(" °C"));
        DEBUG_SERIAL_PRINTLN(F("Outdoor humidity: ") + String(outdoorWeather.humidity) + F(" %rH"));
#endif

