ch570512/Qlockwork/src/main.cpp
#ifdef SYSLOGSERVER_SERVER
        Serial.println(F("Starting syslog."));
#ifdef WEATHER
        syslog.log(LOG_INFO, ";#;dateTime;roomTemperature;roomHumidity;outdoorTemperature;outdoorHumidity;sunriseTime;sunsetTime;ldrValue;errorCounterNTP;errorCounterDHT;errorCounterOutdoorWeather;freeHeapSize;upTime");
#else
        syslog.log(LOG_INFO, ";#;dateTime;roomTemperature;roomHumidity;ldrValue;errorCounterNTP;errorCounterDHT;freeHeapSize;upTime");
#endif
#endif
    }

#ifdef SHOW_IP
    // WiFi.isConnected() ? feedText = "  IP: " : feedText = "  AP-IP: ";
    feedText = "  IP: ";
    feedText += String(myIP[0]) + "." + String(myIP[1]) + "." + String(myIP[2]) + "." + String(myIP[3]) + "   ";
    feedPosition = 0;
    feedColor = WHITE;
    mode = MODE_FEED;
#endif

#ifdef WEBSERVER
    Serial.println(F("Starting webserver."));
    setupWebServer();
#endif

#ifdef ARDUINO_OTA
    Serial.println(F("Starting OTA."));
    ArduinoOTA.begin();
#endif

    renderer.clearScreenBuffer(matrix);

#ifdef RTC_BACKUP
    RTC.begin();
    setSyncProvider(getRTCTime);
    Serial.print(F("RTC sync."));
    if (timeStatus() != timeSet)
    {
        Serial.print(F(" FAIL!"));
    }
    Serial.println();
#ifdef DEBUG
    time_t tempRtcTime = RTC.get();
    Serial.printf("Time (RTC): %02u:%02u:%02u %02u.%02u.%04u\n", hour(tempRtcTime), minute(tempRtcTime), second(tempRtcTime), day(tempRtcTime), month(tempRtcTime), year(tempRtcTime));
#endif
#endif

    // Configure NTP
    configTime(NTP_TIMEZONE, NTP_SERVER);
    DEBUG_SERIAL_PRINTLN(F("NTP Timezone: ") + String(NTP_TIMEZONE));
    DEBUG_SERIAL_PRINTLN(F("NTP Server: ") + String(NTP_SERVER));
    Serial.println(F("NTP sync."));
    time_t now_time_t = time(nullptr);
    struct tm *p_tm = localtime(&now_time_t);
    while (now_time_t < 8 * 3600 * 2)
    {
        delay(500);
        now_time_t = time(nullptr);
    }
    Serial.printf("Time (ESP): %02d:%02d:%02d %02u.%02u.%04u\n", p_tm->tm_hour, p_tm->tm_min, p_tm->tm_sec, p_tm->tm_mday, p_tm->tm_mon, p_tm->tm_year);

    // Define a random time
    randomSeed(analogRead(A0));
    randomHour = random(0, 24);
    randomMinute = random(5, 56);

    // Update room conditions
#if defined(RTC_BACKUP) || defined(SENSOR_DHT22)
    getRoomConditions();
#endif

    // Print some infos
#ifdef DEBUG
#ifdef EVENT_TIME
    Serial.printf("Defined events: %u\n", sizeof(events) / sizeof(event_t) - 1);
#endif
    Serial.printf("Day on: %02u:%02u:00\n", hour(settings.mySettings.dayOnTime), minute(settings.mySettings.dayOnTime));
    Serial.printf("Night off: %02u:%02u:00\n", hour(settings.mySettings.nightOffTime), minute(settings.mySettings.nightOffTime));
    Serial.printf("Alarm1: %02u:%02u:00 ", hour(settings.mySettings.alarm1Time), minute(settings.mySettings.alarm1Time));
    settings.mySettings.alarm1 ? Serial.print("on ") : Serial.print("off ");
    Serial.println(settings.mySettings.alarm1Weekdays, BIN);
    Serial.printf("Alarm2: %02u:%02u:00 ", hour(settings.mySettings.alarm2Time), minute(settings.mySettings.alarm2Time));
    settings.mySettings.alarm2 ? Serial.print("on ") : Serial.print("off ");
    Serial.println(settings.mySettings.alarm2Weekdays, BIN);
    Serial.printf("Random time: %02u:%02u\n", randomHour, randomMinute);
    Serial.println("DEBUG enabled.");
#else
    Serial.println(F("DEBUG disabled."));
#endif

    lastDay = p_tm->tm_mday - 1;
    lastHour = p_tm->tm_hour;
    lastMinute = p_tm->tm_min;
    lastSecond = p_tm->tm_sec;

#ifdef FRONTCOVER_BINARY
    settings.mySettings.transition = TRANSITION_NORMAL;
#endif
} // setup()

//=============================================================================
// Loop()
//=============================================================================

void loop()
{
    // Call HTTP-handle
#ifdef WEBSERVER
    webServer.handleClient();
#endif

    // Call OTA-handle
#ifdef ARDUINO_OTA
    ArduinoOTA.handle();
#endif

    time_t now_time_t = time(nullptr);
    struct tm *p_tm = localtime(&now_time_t);

    //=============================================================================
    // Run once a day
    //=============================================================================

    if (p_tm->tm_mday != lastDay)
    {
        lastDay = p_tm->tm_mday;
        screenBufferNeedsUpdate = true;

        // reset millis() because they will overflow at some time
#ifdef LDR
        iBrightnessMillis = 0;
#endif
#if defined(SHOW_MODE_SUNRISE_SUNSET) && defined(WEATHER)
        sunrise_millis = 0;
        sunset_millis = 0;
#endif

#ifdef SHOW_MODE_MOONPHASE
        moonphase = getMoonphase(p_tm->tm_year, p_tm->tm_mon, p_tm->tm_mday);
#endif

        // Reset URL event 0
        events[0].day = 0;
        events[0].month = 0;

#ifdef DEBUG
        Serial.printf("Uptime: %u days, %02u:%02u\n", int(upTime / 86400), hour(upTime), minute(upTime));
        Serial.printf("Free RAM: %u bytes\n", system_get_free_heap_size());
        Serial.printf("Moonphase: %u\n", moonphase);
#endif

        // Change color
        if (settings.mySettings.colorChange == COLORCHANGE_DAY)
        {
            settings.mySettings.color = random(0, COLORCHANGE_COUNT + 1);
#ifdef DEBUG
            Serial.printf("Color changed to: %u\n", settings.mySettings.color);
#endif
        }
    }

    //=============================================================================
    // Run once every hour
    //=============================================================================

    if (p_tm->tm_hour != lastHour)
    {
        lastHour = p_tm->tm_hour;
        screenBufferNeedsUpdate = true;

        // Change color
        if (settings.mySettings.colorChange == COLORCHANGE_HOUR)
        {
            settings.mySettings.color = random(0, COLOR_COUNT + 1);
#ifdef DEBUG
            Serial.printf("Color changed to: %d\n", (int)settings.mySettings.color);
#endif
        }

