ch570512/Qlockwork/src/main.cpp
        // Hourly beep
#ifdef BUZZER
        if ((settings.mySettings.hourBeep == true) && (mode == MODE_TIME))
        {
            digitalWrite(PIN_BUZZER, HIGH);
            delay(25);
            digitalWrite(PIN_BUZZER, LOW);
#ifdef DEBUG
            Serial.println("Beep!");
#endif
        }
#endif

        //=============================================================================
        // Run once every random hour (once a day)
        //=============================================================================

        if (p_tm->tm_hour == randomHour)
        {
        }
    }

    //=============================================================================
    // Run once every minute
    //=============================================================================

    if (p_tm->tm_min != lastMinute)
    {
        lastMinute = p_tm->tm_min;
        screenBufferNeedsUpdate = true;

#if defined(RTC_BACKUP) || defined(SENSOR_DHT22)
        // Update room conditions
        getRoomConditions();
#endif

#ifdef BUZZER
        // Switch on buzzer for alarm 1
        if (settings.mySettings.alarm1 && (p_tm->tm_hour == hour(settings.mySettings.alarm1Time)) && (p_tm->tm_min == minute(settings.mySettings.alarm1Time)) && bitRead(settings.mySettings.alarm1Weekdays, p_tm->tm_wday))
        {
            alarmOn = BUZZTIME_ALARM_1;
#ifdef DEBUG
            Serial.println("Alarm1 on.");
#endif
        }

        // Switch on buzzer for alarm 2
        if (settings.mySettings.alarm2 && (p_tm->tm_hour == hour(settings.mySettings.alarm2Time)) && (p_tm->tm_min == minute(settings.mySettings.alarm2Time)) && bitRead(settings.mySettings.alarm2Weekdays, p_tm->tm_wday))
        {
            alarmOn = BUZZTIME_ALARM_2;
#ifdef DEBUG
            Serial.println("Alarm2 on.");
#endif
        }
#endif

        // Set night- and daymode
        if ((p_tm->tm_hour == hour(settings.mySettings.nightOffTime)) && (p_tm->tm_min == minute(settings.mySettings.nightOffTime)))
        {
#ifdef DEBUG
            Serial.println("Night off.");
#endif
            setMode(MODE_BLANK);
        }

        if ((p_tm->tm_hour == hour(settings.mySettings.dayOnTime)) && (p_tm->tm_min == minute(settings.mySettings.dayOnTime)))
        {
#ifdef DEBUG
            Serial.println("Day on.");
#endif
            setMode(lastMode);

            if (!WiFi.isConnected())
            {
                ESP.restart();
            }
        }

        //=============================================================================
        // Run once every random minute (once an hour) or if NTP has an error
        //=============================================================================

        if (p_tm->tm_min == randomMinute)
        {
            if (WiFi.isConnected())
            {
                // Get weather from MeteoWeather
#ifdef WEATHER
                !outdoorWeather.getOutdoorConditions(LATITUDE, LONGITUDE, TIMEZONE) ? errorCounterOutdoorWeather++ : errorCounterOutdoorWeather = 0;
#ifdef DEBUG
                Serial.println("Outdoor temperature: " + String(outdoorWeather.temperature) + "°C");
                Serial.println("Outdoor humidity: " + String(outdoorWeather.humidity) + " %rH");
                // Serial.println("Sunrise: " + padStringZeros(String(hour(timeZone.toLocal(outdoorWeather.sunrise)))) + ":" + padStringZeros(String(minute(timeZone.toLocal(outdoorWeather.sunrise)))));
                // Serial.println("Sunset: " + padStringZeros(String(hour(timeZone.toLocal(outdoorWeather.sunset)))) + ":" + padStringZeros(String(minute(timeZone.toLocal(outdoorWeather.sunset)))));
#endif
#endif
            }
            else
            {
                WiFi.reconnect();
            }
        }

        //=============================================================================
        // Run once every 5 minutes
        //=============================================================================

        if (p_tm->tm_min % 5 == 0)
        {
#ifdef SYSLOGSERVER_SERVER
            // Write some data to syslog
            if (WiFi.isConnected())
            {
                time_t tempEspTime = time(nullptr);
#ifdef WEATHER
                // syslog.log(LOG_INFO, ";D;" + String(tempEspTime) + ";" + String(roomTemperature) + ";" + String(roomHumidity) + ";" + String(outdoorWeather.temperature) + ";" + String(outdoorWeather.humidity) + ";" + padStringZeros(String(hour(timeZone.toLocal(outdoorWeather.sunrise)))) + ":" + padStringZeros(String(minute(timeZone.toLocal(outdoorWeather.sunrise)))) + ";" + padStringZeros(String(hour(timeZone.toLocal(outdoorWeather.sunset)))) + ":" + padStringZeros(String(minute(timeZone.toLocal(outdoorWeather.sunset)))) + ";" + String(brightness) + ";" + String(errorCounterNTP) + ";" + String(errorCounterDHT) + ";" + String(errorCounterOutdoorWeather) + ";" + String(ESP.getFreeHeap()) + ";" + String(upTime));
                syslog.log(LOG_INFO, ";D;" + String(tempEspTime) + ";" + String(roomTemperature) + ";" + String(roomHumidity) + ";" + String(outdoorWeather.temperature) + ";" + String(outdoorWeather.humidity) + ";" + padStringZeros(String(hour(timeZone.toLocal(outdoorWeather.sunrise)))) + ":" + padStringZeros(String(minute(timeZone.toLocal(outdoorWeather.sunrise)))) + ";" + padStringZeros(String(hour(timeZone.toLocal(outdoorWeather.sunset)))) + ":" + padStringZeros(String(minute(timeZone.toLocal(outdoorWeather.sunset)))) + ";" + String(brightness) + ";" + ";" + String(errorCounterDHT) + ";" + String(errorCounterOutdoorWeather) + ";" + String(ESP.getFreeHeap()) + ";" + String(upTime));
#else
                // syslog.log(LOG_INFO, ";D;" + String(tempEspTime) + ";" + String(roomTemperature) + ";" + String(roomHumidity) + ";" + String(ldrValue) + ";" + String(errorCounterNTP) + ";" + String(errorCounterDHT) + ";" + String(ESP.getFreeHeap()) + ";" + String(upTime));
                syslog.log(LOG_INFO, ";D;" + String(tempEspTime) + ";" + String(roomTemperature) + ";" + String(roomHumidity) + ";" + String(ldrValue) + ";" + ";" + String(errorCounterDHT) + ";" + String(ESP.getFreeHeap()) + ";" + String(upTime));
#endif
#ifdef DEBUG
                Serial.println("Data written to syslog.");
#endif
            }
#endif

