ch570512/Qlockwork/src/main.cpp
    // Fade old to new matrix
    for (uint8_t i = 0; i < brightness; i++)
    {
        for (uint8_t y = 0; y <= 9; y++)
        {
            for (uint8_t x = 0; x <= 11; x++)
            {
                if (!(bitRead(screenBufferOld[y], 15 - x)) && (bitRead(screenBufferNew[y], 15 - x)))
                {
                    brightnessBuffer[y][x]++;
                }
                if ((bitRead(screenBufferOld[y], 15 - x)) && !(bitRead(screenBufferNew[y], 15 - x)))
                {
                    brightnessBuffer[y][x]--;
                }
                ledDriver.setPixel(x, y, color, brightnessBuffer[y][x]);
            }
        }

        // Corner LEDs
        for (uint8_t y = 0; y <= 3; y++)
        {
            ledDriver.setPixel(110 + y, color, brightnessBuffer[y][11]);
        }

        // Alarm LED
#ifdef BUZZER
#ifdef ALARM_LED_COLOR
#ifdef ABUSE_CORNER_LED_FOR_ALARM
        if (settings.mySettings.alarm1 || settings.mySettings.alarm2 || alarmTimerSet)
        {
            ledDriver.setPixel(111, ALARM_LED_COLOR, brightnessBuffer[4][11]);
        }
        else
        {
            ledDriver.setPixel(111, color, brightnessBuffer[1][11]);
        }
#else
        ledDriver.setPixel(114, ALARM_LED_COLOR, brightnessBuffer[4][11]);
#endif
#else
        ledDriver.setPixel(114, color, brightnessBuffer[4][11]);
#endif
#endif
        ledDriver.show();
    }
} // writeScreenBufferFade

//=============================================================================
// "On/off" pressed
//=============================================================================

#ifdef ONOFF_BUTTON
ICACHE_RAM_ATTR void buttonOnOffInterrupt()
{
    if (millis() > lastButtonPress + 250)
    {
        lastButtonPress = millis();
        buttonOnOffPressed();
    }
}
#endif

void buttonOnOffPressed()
{
#ifdef DEBUG
    Serial.println("On/off pressed.");
#endif
    mode == MODE_BLANK ? setLedsOn() : setLedsOff();
}

//=============================================================================
// "Time" pressed
//=============================================================================

#ifdef TIME_BUTTON
ICACHE_RAM_ATTR void buttonTimeInterrupt()
{
    if (millis() > lastButtonPress + 250)
    {
        lastButtonPress = millis();
        buttonTimePressed();
    }
}
#endif

void buttonTimePressed()
{
#ifdef DEBUG
    Serial.println("Time pressed.");
#endif

    // Switch off alarm
#ifdef BUZZER
    if (alarmOn)
    {
#ifdef DEBUG
        Serial.println("Alarm: off");
#endif
        digitalWrite(PIN_BUZZER, LOW);
        alarmOn = false;
    }
#endif
#if defined(SHOW_MODE_SUNRISE_SUNSET) && defined(WEATHER)
    settings.mySettings.color = save_color_sunrise_sunset;
#endif
    modeTimeout = 0;
    setMode(MODE_TIME);
}

//=============================================================================
// "Mode" pressed
//=============================================================================

#ifdef MODE_BUTTON
ICACHE_RAM_ATTR void buttonModeInterrupt()
{
    if (millis() > lastButtonPress + 250)
    {
        lastButtonPress = millis();
        buttonModePressed();
    }
}
#endif

void buttonModePressed()
{
#ifdef DEBUG
    Serial.println("Mode pressed.");
#endif

    // Switch off alarm
#ifdef BUZZER
    if (alarmOn)
    {
#ifdef DEBUG
        Serial.println("Alarm: off");
#endif
        digitalWrite(PIN_BUZZER, LOW);
        alarmOn = false;
        setMode(MODE_TIME);
        return;
    }
#endif
    setMode(mode++);
}

//=============================================================================
// Set mode
//=============================================================================

void setMode(Mode newMode)
{
    screenBufferNeedsUpdate = true;
    runTransitionOnce = true;
    lastMode = mode;
    mode = newMode;

    // set timeout for selected mode
    switch (mode)
    {
#ifdef SHOW_MODE_AMPM
    case MODE_AMPM:
#endif
#ifdef SHOW_MODE_SECONDS
    case MODE_SECONDS:
#endif
#ifdef SHOW_MODE_WEEKDAY
    case MODE_WEEKDAY:
#endif
#ifdef SHOW_MODE_DATE
    case MODE_DATE:
#endif
// #if defined(SHOW_MODE_SUNRISE_SUNSET) && defined(WEATHER)
//     case MODE_SUNRISE:
//     case MODE_SUNSET:
// #endif
#ifdef SHOW_MODE_MOONPHASE
    case MODE_MOONPHASE:
#endif
#if defined(RTC_BACKUP) && !defined(SENSOR_DHT22)
    case MODE_TEMP:
#endif
#ifdef SENSOR_DHT22
    case MODE_TEMP:
    case MODE_HUMIDITY:
#endif
#ifdef WEATHER
    case MODE_EXT_TEMP:
    case MODE_EXT_HUMIDITY:
#endif
        modeTimeout = millis();
        break;
    default:
        modeTimeout = 0;
        break;
    }
}

//=============================================================================
// Get reading from LDR
//=============================================================================

#ifdef LDR
uint8_t getBrightnessFromLDR()
{
    uint16_t ldrValue = 0;
    static uint16_t lastLdrValue = 0;
    static uint16_t minLdrValue = 511;
    static uint16_t maxLdrValue = 512;

#ifdef LDR_IS_INVERSE
    ldrValue = 1023 - analogRead(PIN_LDR);
#else
    ldrValue = analogRead(PIN_LDR);
#endif

    if (ldrValue < minLdrValue)
    {
        minLdrValue = ldrValue;
    }
    if (ldrValue > maxLdrValue)
    {
        maxLdrValue = ldrValue;
    }
    if ((ldrValue >= (lastLdrValue + 30)) || (ldrValue <= (lastLdrValue - 30))) // Hysteresis
    {
        lastLdrValue = ldrValue;
        return map(ldrValue, minLdrValue, maxLdrValue, MIN_BRIGHTNESS, maxBrightness);
    }
    return iTargetBrightness;
}
#endif

//=============================================================================
// Get room conditions
//=============================================================================

#if defined(RTC_BACKUP) || defined(SENSOR_DHT22)
void getRoomConditions()
{
#if defined(RTC_BACKUP) && !defined(SENSOR_DHT22)
    roomTemperature = RTC.temperature() / 4.0 + RTC_TEMPERATURE_OFFSET;
#ifdef DEBUG
    Serial.println("Temperature (RTC): " + String(roomTemperature) + " °C");
#endif
#endif
#ifdef SENSOR_DHT22
    float dhtTemperature = dht.readTemperature();
    float dhtHumidity = dht.readHumidity();
    if (!isnan(dhtTemperature) && !isnan(dhtHumidity))
    {
        errorCounterDHT = 0;
        roomTemperature = dhtTemperature + DHT_TEMPERATURE_OFFSET;
        roomHumidity = dhtHumidity + DHT_HUMIDITY_OFFSET;
#ifdef DEBUG
        Serial.println("Temperature (DHT): " + String(roomTemperature) + " °C");
        Serial.println("Humidity (DHT): " + String(roomHumidity) + " %rH");
#endif
    }
    else
    {
        if (errorCounterDHT < 255)
        {
            errorCounterDHT++;
        }
#ifdef DEBUG
        Serial.printf("Error (DHT): %u\n", errorCounterDHT);
#endif
    }
#endif
}
#endif

