ch570512/Qlockwork/src/main.cpp
//=============================================================================
// Misc
//=============================================================================

// Switch off LEDs
void setLedsOff()
{
#ifdef DEBUG
    Serial.println("LEDs: off");
#endif
    setMode(MODE_BLANK);
}

// Switch on LEDs
void setLedsOn()
{
#ifdef DEBUG
    Serial.println("LEDs: on");
#endif
    setMode(lastMode);
}

// Calculate moonphase
#ifdef SHOW_MODE_MOONPHASE
int getMoonphase(int y, int m, int d)
{
    int b = 0;
    int c = 0;
    int e = 0;
    double jd = 0;

    if (m < 3)
    {
        y--;
        m += 12;
    }
    ++m;
    c = 365.25 * y;
    e = 30.6 * m;
    jd = c + e + d - 694039.09; // jd is total days elapsed
    jd /= 29.53;                // divide by the moon cycle (29.53 days)
    b = jd;                     // int(jd) -> b, take integer part of jd
    jd -= b;                    // subtract integer part to leave fractional part of original jd
    b = jd * 8 + 0.5;           // scale fraction from 0-8 and round by adding 0.5
    b = b & 7;                  // 0 and 8 are the same so turn 8 into 0
    return b;
}
#endif

String padStringZeros(String input)
{
    return (input.length() > 1) ? input : "0" + input;
}

#ifdef RTC_BACKUP
time_t getRTCTime()
{
    return RTC.get();
}
#endif

//=============================================================================
// Webserver
//=============================================================================

#ifdef WEBSERVER
void setupWebServer()
{
    webServer.onNotFound([]()
                         { handleNotFound(webServer); });
    webServer.on("/", handleRoot);
    webServer.on("/handleButtonOnOff", []()
                 { buttonOnOffPressed(); callRoot(); });
    webServer.on("/handleButtonSettings", handleButtonSettings);
    webServer.on("/handleButtonMode", []()
                 { buttonModePressed(); callRoot(); });
    webServer.on("/handleButtonTime", []()
                 {    buttonTimePressed(); callRoot(); });
    webServer.on("/commitSettings", handleCommitSettings);
    webServer.on("/reset", []()
                 { handleReset(webServer); });
    webServer.on("/setEvent", handleSetEvent);
    webServer.on("/showText", handleShowText);
    webServer.on("/control", handleControl);
    webServer.begin();
}

void callRoot()
{
    webServer.send(200, "text/html", "<!doctype html><html><head><script>window.onload=function(){window.location.replace('/');}</script></head></html>");
}

// Page /
void handleRoot()
{
    String message = "<!doctype html>"
                     "<html>"
                     "<head>"
                     "<title>" +
                     String(WEBSITE_TITLE) +
                     "</title>"
                     "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">"
                     "<meta http-equiv=\"refresh\" content=\"60\" charset=\"UTF-8\">"
                     "<link rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css\">"
                     "<style>"
                     "body{background-color:#FFFFFF;text-align:center;color:#333333;font-family:Sans-serif;font-size:16px;}"
                     "button{background-color:#1FA3EC;text-align:center;color:#FFFFFF;width:200px;padding:10px;border:5px solid #FFFFFF;font-size:24px;border-radius:10px;}"
                     "</style>"
                     "</head>"
                     "<body>"
                     "<h1>" +
                     String(WEBSITE_TITLE) +
                     "</h1>";
#ifdef DEDICATION
    message += DEDICATION;
    message += "<br><br>";
#endif
    if (mode == MODE_BLANK)
        message += "<button title=\"Switch LEDs on\" onclick=\"window.location.href='/handleButtonOnOff'\"><i class=\"fa fa-toggle-off\"></i></button>";
    else
        message += "<button title=\"Switch LEDs off\" onclick=\"window.location.href='/handleButtonOnOff'\"><i class=\"fa fa-toggle-on\"></i></button>";
    message += "<button title=\"Settings\" onclick=\"window.location.href='/handleButtonSettings'\"><i class=\"fa fa-gear\"></i></button>"
               "<br><br>"
               "<button title=\"Switch modes\" onclick=\"window.location.href='/handleButtonMode'\"><i class=\"fa fa-bars\"></i></button>"
               "<button title=\"Return to time\" onclick=\"window.location.href='/handleButtonTime'\"><i class=\"fa fa-clock-o\"></i></button>";
#if defined(RTC_BACKUP) || defined(SENSOR_DHT22)
    message += "<br><br><i class = \"fa fa-home\" style=\"font-size:20px;\"></i>";
    message += "<br><i class=\"fa fa-thermometer\" style=\"font-size:20px;\"></i> " + String(roomTemperature) + "&deg;C / " + String(roomTemperature * 1.8 + 32.0) + "&deg;F";
#endif
#ifdef SENSOR_DHT22
    message += "<br><i class=\"fa fa-tint\" style=\"font-size:20px;\"></i> " + String(roomHumidity) + "%rH"
                                                                                                      "<br><span style=\"font-size:20px;\">";
    if (roomHumidity < 30)
        message += "<i style=\"color:Red;\" class=\"fa fa-square\"\"></i>";
    else
        message += "<i style=\"color:Red;\" class=\"fa fa-square-o\"></i>";
    if ((roomHumidity >= 30) && (roomHumidity < 40))
        message += "&nbsp;<i style=\"color:Orange;\" class=\"fa fa-square\"></i>";
    else
        message += "&nbsp;<i style=\"color:Orange;\" class=\"fa fa-square-o\"></i>";
    if ((roomHumidity >= 40) && (roomHumidity <= 50))
        message += "&nbsp;<i style=\"color:MediumSeaGreen;\" class=\"fa fa-square\"></i>";
    else
        message += "&nbsp;<i style=\"color:MediumSeaGreen;\" class=\"fa fa-square-o\"></i>";
    if ((roomHumidity > 50) && (roomHumidity < 60))
        message += "&nbsp;<i style=\"color:Lightblue;\" class=\"fa fa-square\"></i>";
    else
        message += "&nbsp;<i style=\"color:Lightblue;\" class=\"fa fa-square-o\"></i>";
    if (roomHumidity >= 60)
        message += "&nbsp;<i style=\"color:Blue;\" class=\"fa fa-square\"></i>";
    else
        message += "&nbsp;<i style=\"color:Blue;\" class=\"fa fa-square-o\"></i>";
    message += "</span>";
#endif
#ifdef WEATHER
    message += "<br><br><i class = \"fa fa-tree\" style=\"font-size:20px;\"></i>"
               "<br><i class = \"fa fa-thermometer\" style=\"font-size:20px;\"></i> " +
               String(outdoorWeather.temperature) + "&deg;C / " + String(outdoorWeather.temperature * 1.8 + 32.0) + "&deg;F" +
               "<br><i class = \"fa fa-tint\" style=\"font-size:20px;\"></i> " + String(outdoorWeather.humidity) + "%rH" +
               "<br>" + String(outdoorWeather.pressure) + " hPa / " + String(outdoorWeather.pressure / 33.865) + " inHg" +
               "<br><i class = \"fa fa-sun-o\" style=\"font-size:20px;\"></i> " + padStringZeros(String("")) + ":" + padStringZeros(String("")) +
               " <i class = \"fa fa-moon-o\" style=\"font-size:20px;\"></i> " + padStringZeros(String("")) + ":" + padStringZeros(String(""));
#endif
    message += "<span style=\"font-size:12px;\">"
               "<br><br><a href=\"https://github.com/ch570512/Qlockwork\">Qlockwork</a> was <i class=\"fa fa-code\"></i> with <i class=\"fa fa-heart\"></i> by ch570512"
               "<br>Firmware: " +
               String(FIRMWARE_VERSION);
#ifdef DEBUG_WEB
    time_t tempEspTime = time(nullptr);
    message += "<br><br>Time: " + String(hour(tempEspTime)) + ":";
    if (minute(tempEspTime) < 10)
        message += "0";
    message += String(minute(tempEspTime));
    // if (timeZone.locIsDST(now()))
    //     message += " (DST)";
    message += " up " + String(int(upTime / 86400)) + " days, " + String(hour(upTime)) + ":";
    if (minute(upTime) < 10)
        message += "0";
    message += String(minute(upTime));
    message += "<br>" + String(dayStr(weekday(tempEspTime))) + ", " + String(monthStr(month(tempEspTime))) + " " + String(day(tempEspTime)) + ". " + String(year(tempEspTime));
    message += "<br>Moonphase: " + String(moonphase);
    message += "<br>Free RAM: " + String(ESP.getFreeHeap()) + " bytes";
    message += "<br>RSSI: " + String(WiFi.RSSI());
#ifdef LDR
    message += "<br>Brightness: " + String(brightness) + " (ABC: ";
    settings.mySettings.useAbc ? message += "enabled)" : message += "disabled)";
    // settings.mySettings.useAbc ? message += "enabled" : message += "disabled";
    // message += ", min: " + String(MIN_BRIGHTNESS) + ", max : " + String(maxBrightness) + ")";
    // message += "<br>LDR: " + String(ldrValue) + " (min: " + String(minLdrValue) + ", max: " + String(maxLdrValue) + ")";
#endif
    // message += "<br>Error (NTP): " + String(errorCounterNTP);
#ifdef SENSOR_DHT22
    message += "<br>Error (DHT): " + String(errorCounterDHT);
#endif
#ifdef WEATHER
    message += "<br>Error (MeteoWeather): " + String(errorCounterOutdoorWeather);
#endif
    message += "<br>Reset reason: " + ESP.getResetReason();
    message += "<br>Flags: ";
#ifdef RTC_BACKUP
    message += "RTC ";
#else
    message += "<s>RTC</s> ";
#endif
#ifdef SENSOR_DHT22
    message += "DHT22 ";
#else
    message += "<s>DHT22</s> ";
#endif
#ifdef LDR
    message += "LDR ";
#else
    message += "<s>LDR</s> ";
#endif
#ifdef BUZZER
    message += "BUZZER ";
#else
    message += "<s>BUZZER</s> ";
#endif
#ifdef IR_RECEIVER
    message += "IR_RECEIVER ";
#else
    message += "<s>IR_RECEIVER</s> ";
#endif
#ifdef ESP_LED
    message += "ESP_LED ";
#else
    message += "<s>ESP_LED</s> ";
#endif
#if defined(ONOFF_BUTTON) || defined(MODE_BUTTON) || defined(TIME_BUTTON)
    message += "BUTTONS ";
#else
    message += "<s>BUTTONS</s> ";
#endif
#endif
    message += "</span></body></html>";
    webServer.send(200, "text/html", message);
}

